In [1]:
# syntax data={key:value}
my_dictionary={
    "name":"person1",
    "age": 35,
    "salary": 4000
}

In [3]:
print(my_dictionary)

{'name': 'person1', 'age': 35, 'salary': 4000}

In [7]:
#storing information of more than one person
my_dictionary={
    "name":["person1", "person2","person3","person4","person5"],
    "age": [35,36,37,38,39],
    "salary": [4000, 5000, 6000, 7000, 8000]
}

In [11]:
my_dictionary

{'name': ['person1', 'person2', 'person3', 'person4', 'person5'],
 'age': [35, 36, 37, 38, 39],
 'salary': [4000, 5000, 6000, 7000, 8000]}

In [15]:
"""dictionary operations
    replace value
    add key
    deleting value
    accessing items in dictionary
    """
my_dictionary['location']= ["Mombasa",'Kisumu','Nairobi','Migori','Kisii']#adding key to a dictionary

In [17]:
my_dictionary

{'name': ['person1', 'person2', 'person3', 'person4', 'person5'],
 'age': [35, 36, 37, 38, 39],
 'salary': [4000, 5000, 6000, 7000, 8000],
 'location': ['Mombasa', 'Kisumu', 'Nairobi', 'Migori', 'Kisii']}

In [19]:
for key, value in my_dictionary.items(): #accessing each item in dictionary
    print(key, value)

name ['person1', 'person2', 'person3', 'person4', 'person5']
age [35, 36, 37, 38, 39]
salary [4000, 5000, 6000, 7000, 8000]
location ['Mombasa', 'Kisumu', 'Nairobi', 'Migori', 'Kisii']

In [ ]:
'''Data Frames created from a dictionary

'''

In [21]:
import pandas as pd# pandas is a library stored in a variable named pd

In [23]:
my_dictionary

{'name': ['person1', 'person2', 'person3', 'person4', 'person5'],
 'age': [35, 36, 37, 38, 39],
 'salary': [4000, 5000, 6000, 7000, 8000],
 'location': ['Mombasa', 'Kisumu', 'Nairobi', 'Migori', 'Kisii']}

In [25]:
df=pd.DataFrame(my_dictionary)#the my_dictionary has been stored in variable df
#DataFrame converts dictionary to a table key is the column name the values are the records

In [27]:
df

      name  age  salary location
0  person1   35    4000  Mombasa
1  person2   36    5000   Kisumu
2  person3   37    6000  Nairobi
3  person4   38    7000   Migori
4  person5   39    8000    Kisii

In [29]:
df["name"]

0    person1
1    person2
2    person3
3    person4
4    person5
Name: name, dtype: object

In [31]:
df['age']

0    35
1    36
2    37
3    38
4    39
Name: age, dtype: int64

In [33]:
df[['name', 'age']] #accessing more than one column use 2 brackets

      name  age
0  person1   35
1  person2   36
2  person3   37
3  person4   38
4  person5   39

In [57]:
df['age']+1#updating each age with 1 more year

0    39
1    40
2    41
3    42
4    43
Name: age, dtype: int64

In [41]:
df.dtypes

name        object
age          int64
salary       int64
location    object
dtype: object

In [53]:
df['age']=df['age']+1 #updating the column age

In [55]:
df

      name  age  salary location
0  person1   38    4000  Mombasa
1  person2   39    5000   Kisumu
2  person3   40    6000  Nairobi
3  person4   41    7000   Migori
4  person5   42    8000    Kisii

In [59]:
df['salary']=df['salary']+200#adding 200 to each salary

In [61]:
df

      name  age  salary location
0  person1   38    4200  Mombasa
1  person2   39    5200   Kisumu
2  person3   40    6200  Nairobi
3  person4   41    7200   Migori
4  person5   42    8200    Kisii

In [69]:
df['salary'],df['age']=df['salary']+500, df['age']+1

In [71]:
df

      name  age  salary location
0  person1   39    4700  Mombasa
1  person2   40    5700   Kisumu
2  person3   41    6700  Nairobi
3  person4   42    7700   Migori
4  person5   43    8700    Kisii